x = linspace(-100,100,201);
v1 = exp(-x.^2/1000);%装置関数
v2 = v1(80:120);
% q = 2*exp(-x.^2/100)+exp(-(x-10).^2/1000);%真のスペクトル
q = 2*exp(-(x+30).^2/100);%真のスペクトル
u1 = conv(q,v2);%観測スペクトル
u2 = conv(q,v1,'same');%観測スペクトル
[w,r] = deconv(u1,v2); 
u3 = conv(w,v1,'same');
figure
% plot(x,v1,'k',x,q,'r',x,u2/10,'g')
% legend('装置関数','真のスペクトル','観測スペクトル')
% plot(x,v1,'k',x,q,'r',x,w,'b')
% legend('装置関数','真のスペクトル','復元スペクトル')
plot(x,v1,'k',x,q+0.1,'r',x,u2/16+0.1,'g',x,w,'b',x,u3/16,'m')
legend('装置関数','真のスペクトル','観測スペクトル','復元スペクトル','観測スペクトル(再現)')
